# Преобразование файлов с курсами валют

In [ ]:
import pandas as pd
import numpy as np

### Чтобы работало нужно установить openpyxl

pip install openpyxl

In [26]:
file_name = 'RC_F04_09_2018_T04_11_2022.xlsx'
file_name2 = 'RC_F04_09_2018_T04_11_2022 (1).xlsx'

In [28]:
file = ""
while True:
    step = input("Выбор файла: (1 - рубль/доллар, 2 - рубль/индийская рупия): ")
    if step == "1":
        file = file_name 
        break
    elif step == "2":
        file = file_name2
        break
    else:
        print("Неправильный выбор! Повторите ввод")

Выбор файла: (1 - рубль/доллар, 2 - рубль/индийская рупия)2

In [29]:
df = pd.read_excel(file)

C:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [30]:
df.head()

   nominal       data     curs              cdx
0      100 2022-11-04  75.3688  Индийская рупия
1      100 2022-11-03  74.4509  Индийская рупия
2      100 2022-11-02  74.2213  Индийская рупия
3      100 2022-11-01  74.3682  Индийская рупия
4      100 2022-10-29  74.2613  Индийская рупия

### Получаем из даты год, месяц и день для группировки

In [31]:
df['month'] = df['data'].dt.month

In [32]:
df['day'] = df['data'].dt.day

In [33]:
df['year'] = df['data'].dt.year

In [34]:
df.head()

   nominal       data     curs              cdx  month  day  year
0      100 2022-11-04  75.3688  Индийская рупия     11    4  2022
1      100 2022-11-03  74.4509  Индийская рупия     11    3  2022
2      100 2022-11-02  74.2213  Индийская рупия     11    2  2022
3      100 2022-11-01  74.3682  Индийская рупия     11    1  2022
4      100 2022-10-29  74.2613  Индийская рупия     10   29  2022

### Группируем по году и месяцу и считаем средний курс за месяц

In [35]:
df_average = df.groupby(['year','month']).mean('curs').iloc[1:].reset_index()

In [36]:
df_average.head()

   year  month  nominal       curs        day
0  2018     10    100.0  89.510109  15.954545
1  2018     11    100.0  92.270848  16.142857
2  2018     12    100.0  95.322173  16.409091
3  2019      1    100.0  93.633431  20.500000
4  2019      2    100.0  92.382145  14.700000

### Изменяем дату и возвращаем в единый формат

In [37]:
df_average['day'] = 1

In [38]:
df_average['date'] = pd.to_datetime(df_average.loc[:, ["year", "month", "day"]].astype(str))

In [39]:
df_average.head()

   year  month  nominal       curs  day       date
0  2018     10    100.0  89.510109    1 2018-10-01
1  2018     11    100.0  92.270848    1 2018-11-01
2  2018     12    100.0  95.322173    1 2018-12-01
3  2019      1    100.0  93.633431    1 2019-01-01
4  2019      2    100.0  92.382145    1 2019-02-01

### Выбираем только нужные столбцы

In [40]:
lst_df = df_average[['curs','nominal','date']]
lst_df.head()

        curs  nominal       date
0  89.510109    100.0 2018-10-01
1  92.270848    100.0 2018-11-01
2  95.322173    100.0 2018-12-01
3  93.633431    100.0 2019-01-01
4  92.382145    100.0 2019-02-01

### Записываем в csv файл

In [41]:
file_name = 'dollar_curs.csv'
file_name2 = 'indian_curs.csv'
file = ""
if step == "1":
    file = file_name
else: 
    file = file_name2

In [42]:
lst_df.to_csv(file, sep=';', index=False)